#+TITLE:     Introduction, producing replicable articles and managing a laboratory notebook with emacs/org-mode
#+AUTHOR:    Arnaud Legrand
#+DATE: March 7, 2016
#+STARTUP: overview indent


*This page is under construction, so please check it regularly, especially a few days before the webinar to [[file:index.org#practical-session-requirements][install the software required in the practical session]].*

*** Linux
If you're running a debian system, simply do (as root):
#+begin_src sh :results output :exports both
apt-get update
apt-get install emacs org-mode ess r-base auctex
#+end_src

Then make sure you have a sufficiently recent version
#+begin_src sh :results output :exports both
emacs --version
#+end_src

#+RESULTS:
: GNU Emacs 24.5.1
: Copyright (C) 2015 Free Software Foundation, Inc.
: GNU Emacs comes with ABSOLUTELY NO WARRANTY.
: You may redistribute copies of Emacs
: under the terms of the GNU General Public License.
: For more information about these matters, see the file named COPYING.

I'd say you want at least an emacs 24.4 (October 2014) or 24.5
(April 2015) to be out of troubles. Emacs 24.3 was released in March
2013, i.e., three years ago, which is quite old. 

Likewise, you'll want to check you have a recent version of org-mode:
#+begin_src sh :results output :exports both
emacs -batch --funcall "org-version" 2>&1 | grep version
#+end_src

#+RESULTS:
: Org-mode version 8.3.1 (8.3.1-dist @ /usr/share/emacs24/site-lisp/org-mode/)

The current latest version is actually 8.3.3 but you'll want at least
a version 8.2. 
